codelingo/troubleshooting/k8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-01 Thu 15:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shane" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd28d977">1. At the moment, just hitting this like everyone else</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd28d977" class="outline-2">
<h2 id="orgd28d977"><span class="section-number-2">1</span> At the moment, just hitting this like everyone else</h2>
<div class="outline-text-2" id="text-1">
<p>
But on the failure noted in the card, it was about 20 min into review.
</p>

<div class="org-src-container">
<pre class="src src-text">mullikine hit a lexicon <span style="color: #ffff00; background-color: #cccc00;">error</span>: request <span style="color: #ffff00; background-color: #cccc00;">failed</span> after 12 attempts: request dump POST /register HTTP/1.1 Host: router.lexicon-engine.svc.cluster.local:80 Content-Type: application/json  {"lexicon":"codelingo-vcs-git-latest","setup":{"Steps":[]}}: Post http://router.lexicon-engine.svc.cluster.local:80/r&#8230;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">8caf2bd115 k8-test 'codelingo/k8-test' &#187; lingo run review --debug
working_dir (initial):
2018-11-01T15:34:30.876+1300    DEBUG   review/cli.go:89        reviewCMD called
Syncing your repo...
Running review flow...
2018-11-01T15:34:32.291+1300    DEBUG   review/review.go:24     opening connection to flow server ...
2018-11-01T15:34:32.291+1300    DEBUG   service/service.go:76   getting tls cert from cache...
2018-11-01T15:34:32.292+1300    DEBUG   service/service.go:125  dialing grpc server...
2018-11-01T15:34:32.292+1300    DEBUG   service/service.go:109  ...got answer from grpc server.
2018-11-01T15:34:32.292+1300    DEBUG   review/review.go:29     ...connection to flow server opened
2018-11-01T15:34:32.292+1300    DEBUG   review/review.go:43     sending request to flow server...
2018-11-01T15:34:33.069+1300    DEBUG   review/review.go:48     ...request to flow server sent. Received reply channel.
2018-11-01T15:36:01.944+1300    DEBUG   flow/cli.go:237 Result <span style="color: #ffff00; background-color: #cccc00;">error</span>: /home/shane/go/src/github.com/codelingo/codelingo/flows/codelingo/review/review/review.go:68: Sorry, an <span style="color: #ffff00; background-color: #cccc00;">error</span> occurred while processing your request. Please try again.
2018-11-01T15:36:01.944+1300    DEBUG   flow/cli.go:206 /home/shane/go/src/github.com/codelingo/codelingo/flows/codelingo/review/review/review.go:68: Sorry, an <span style="color: #ffff00; background-color: #cccc00;">error</span> occurred while processing your request. Please try again.
/home/shane/go/src/github.com/codelingo/codelingo/sdk/flow/cli.go:238:
Sorry, an <span style="color: #ffff00; background-color: #cccc00;">error</span> occurred while processing your request. Please try again.
exit status 1
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">mullikine hit a lexicon <span style="color: #ffff00; background-color: #cccc00;">error</span>: request <span style="color: #ffff00; background-color: #cccc00;">failed</span> after 12 attempts: request dump POST /register HTTP/1.1 Host: router.lexicon-engine.svc.cluster.local:80 Content-Type: application/json  {"lexicon":"codelingo-vcs-git-latest","setup":{"Steps":[]}}: Post http://router.lexicon-engine.svc.cluster.local:80/r&#8230;
Post http://router.lexicon-engine.svc.cluster.local:80/register: context canceled
/home/dev/projects/src/github.com/codelingo/platform/vendor/github.com/codelingo/lexicon/lib/lexicon/response.go:58: request <span style="color: #ffff00; background-color: #cccc00;">failed</span> after 12 attempts: request dump POST /register HTTP/1.1
Host: router.lexicon-engine.svc.cluster.local:80
Content-Type: application/json

{"lexicon":"codelingo-vcs-git-latest","setup":{"Steps":[]}}
/home/dev/projects/src/github.com/codelingo/platform/vendor/github.com/codelingo/lexicon/lib/lexicon/service.go:86: request <span style="color: #ffff00; background-color: #cccc00;">failed</span> after 12 attempts: request dump POST /register HTTP/1.1
Host: router.lexicon-engine.svc.cluster.local:80
Content-Type: application/json

{"lexicon":"codelingo-vcs-git-latest","setup":{"Steps":[]}}: Post http://router.lexicon-engine.svc.cluster.local:80/register: context canceled
/home/dev/projects/src/github.com/codelingo/platform/backend/lexicon/vcs/generic/generic.go:22:
/home/dev/projects/src/github.com/codelingo/platform/backend/lexicon/factory/factory.go:30:
/home/dev/projects/src/github.com/codelingo/platform/controller/ingestengine/querysubtrees/querysubtrees.go:236:
/home/dev/projects/src/github.com/codelingo/platform/controller/ingestengine/worker/lexicons/vcs/manifold.go:83:
/home/dev/projects/src/github.com/codelingo/platform/controller/ingestengine/ingestengine.go:217:
/home/dev/projects/src/github.com/codelingo/platform/controller/querysession/querysession.go:75:
/home/dev/projects/src/github.com/codelingo/platform/frontend/middleware/errors.go:108: mullikine hit a lexicon <span style="color: #ffff00; background-color: #cccc00;">error</span>
mullikine hit a uncaught <span style="color: #ffff00; background-color: #cccc00;">error</span>: rpc <span style="color: #ffff00; background-color: #cccc00;">error</span>: code = Internal desc = transport: connection <span style="color: #ffff00; background-color: #cccc00;">error</span>: desc = "transport is closing"
rpc <span style="color: #ffff00; background-color: #cccc00;">error</span>: code = Internal desc = transport: connection <span style="color: #ffff00; background-color: #cccc00;">error</span>: desc = "transport is closing"
/home/dev/projects/src/github.com/codelingo/platform/frontend/service/internal.go:87:
/home/dev/projects/src/github.com/codelingo/platform/frontend/middleware/errors.go:108: mullikine hit a uncaught <span style="color: #ffff00; background-color: #cccc00;">error</span>
mullikine hit a lexicon <span style="color: #ffff00; background-color: #cccc00;">error</span>: request <span style="color: #ffff00; background-color: #cccc00;">failed</span> after 12 attempts: request dump POST /register HTTP/1.1 Host: router.lexicon-engine.svc.cluster.local:80 Content-Type: application/json  {"lexicon":"codelingo-vcs-git-latest","setup":{"Steps":[]}}: Post http://router.lexicon-engine.svc.cluster.local:80/r&#8230;
Post http://router.lexicon-engine.svc.cluster.local:80/register: context canceled
/home/dev/projects/src/github.com/codelingo/platform/vendor/github.com/codelingo/lexicon/lib/lexicon/response.go:58: request <span style="color: #ffff00; background-color: #cccc00;">failed</span> after 12 attempts: request dump POST /register HTTP/1.1
Host: router.lexicon-engine.svc.cluster.local:80
Content-Type: application/json

{"lexicon":"codelingo-vcs-git-latest","setup":{"Steps":[]}}
/home/dev/projects/src/github.com/codelingo/platform/vendor/github.com/codelingo/lexicon/lib/lexicon/service.go:86: request <span style="color: #ffff00; background-color: #cccc00;">failed</span> after 12 attempts: request dump POST /register HTTP/1.1
Host: router.lexicon-engine.svc.cluster.local:80
Content-Type: application/json

{"lexicon":"codelingo-vcs-git-latest","setup":{"Steps":[]}}: Post http://router.lexicon-engine.svc.cluster.local:80/register: context canceled
/home/dev/projects/src/github.com/codelingo/platform/backend/lexicon/vcs/generic/generic.go:22:
/home/dev/projects/src/github.com/codelingo/platform/backend/lexicon/factory/factory.go:30:
/home/dev/projects/src/github.com/codelingo/platform/controller/ingestengine/querysubtrees/querysubtrees.go:236:
/home/dev/projects/src/github.com/codelingo/platform/controller/ingestengine/worker/lexicons/vcs/manifold.go:83:
/home/dev/projects/src/github.com/codelingo/platform/controller/ingestengine/ingestengine.go:217:
/home/dev/projects/src/github.com/codelingo/platform/controller/querysession/querysession.go:75:
/home/dev/projects/src/github.com/codelingo/platform/frontend/middleware/errors.go:108: mullikine hit a lexicon <span style="color: #ffff00; background-color: #cccc00;">error</span>
[OK] CPU Usage by Node alert
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: shane</p>
<p class="date">Created: 2018-11-01 Thu 15:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>